#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
data.metabase_permissions_graph.current: Reading...
metabase_database.bigquery[0]: Refreshing state... [name=MFB BigQuery Analytics]
metabase_database.tenant_postgres["cesn"]: Refreshing state... [name=MFB PostgreSQL CESN]
metabase_database.tenant_postgres["ma"]: Refreshing state... [name=MFB PostgreSQL Massachusetts]
metabase_database.tenant_postgres["tx"]: Refreshing state... [name=MFB PostgreSQL Texas]
metabase_database.tenant_postgres["nc"]: Refreshing state... [name=MFB PostgreSQL North Carolina]
metabase_database.tenant_postgres["co"]: Refreshing state... [name=MFB PostgreSQL Colorado]
metabase_database.tenant_postgres["il"]: Refreshing state... [name=MFB PostgreSQL Illinois]
metabase_database.tenant_postgres["co_tax_calculator"]: Refreshing state... [name=MFB PostgreSQL CO Tax Calculator]
metabase_database.postgres: Refreshing state... [name=MFB PostgreSQL Analytics]
data.metabase_permissions_graph.current: Read complete after 0s
time_sleep.wait_for_database_sync: Refreshing state... [id=2026-03-13T16:31:13Z]
data.metabase_table.tenant_screen_summary_tables["il"]: Reading...
data.metabase_table.tenant_screen_summary_tables["ma"]: Reading...
metabase_collection.global: Refreshing state... [id=34]
data.metabase_table.tenant_screen_summary_tables["co_tax_calculator"]: Reading...
data.external.partner_field_ids: Reading...
data.metabase_table.screen_summary_table: Reading...
data.metabase_table.conversion_funnel_table[0]: Reading...
data.metabase_table.tenant_screen_summary_tables["cesn"]: Reading...
data.metabase_table.tenant_screen_summary_tables["co"]: Reading...
data.metabase_table.tenant_screen_summary_tables["nc"]: Reading...
data.metabase_table.tenant_screen_summary_tables["tx"]: Reading...
data.metabase_table.conversion_funnel_table[0]: Read complete after 1s [name=mart_screener_conversion_funnel]
metabase_collection.tenant_collection_nc: Refreshing state... [id=35]
data.metabase_table.tenant_screen_summary_tables["cesn"]: Read complete after 1s [name=mart_screener_data]
data.metabase_table.tenant_screen_summary_tables["il"]: Read complete after 1s [name=mart_screener_data]
metabase_card.conversion_funnel[0]: Refreshing state...
metabase_card.global_completed_screeners: Refreshing state...
data.metabase_table.tenant_screen_summary_tables["co_tax_calculator"]: Read complete after 1s [name=mart_screener_data]
metabase_card.global_median_household_size: Refreshing state...
metabase_card.global_top_partners_30d: Refreshing state...
data.metabase_table.tenant_screen_summary_tables["co"]: Read complete after 1s [name=mart_screener_data]
metabase_card.global_income_streams: Refreshing state...
data.metabase_table.tenant_screen_summary_tables["ma"]: Read complete after 1s [name=mart_screener_data]
metabase_card.global_median_monthly_income: Refreshing state...
data.metabase_table.screen_summary_table: Read complete after 1s [name=mart_screener_data]
metabase_card.global_qualified_benefits_table: Refreshing state...
metabase_card.global_median_annual_tax_credits_30d: Refreshing state...
metabase_card.global_median_monthly_benefits: Refreshing state...
metabase_card.global_daily_screeners_30d: Refreshing state...
metabase_card.global_completed_screeners_30d: Refreshing state...
metabase_card.global_median_monthly_benefits_30d: Refreshing state...
metabase_card.global_already_had_benefits_pct: Refreshing state...
metabase_card.global_common_expenses: Refreshing state...
metabase_card.global_immediate_needs_table: Refreshing state...
metabase_card.global_qualified_for_benefits_pct_30d: Refreshing state...
metabase_card.global_top_partners: Refreshing state...
data.metabase_table.tenant_screen_summary_tables["nc"]: Read complete after 2s [name=mart_screener_data]
metabase_card.global_median_monthly_expenses: Refreshing state...
metabase_card.global_qualified_for_tax_creds_pct_30d: Refreshing state...
metabase_card.global_median_annual_benefits_30d: Refreshing state...
metabase_card.global_current_benefits_table: Refreshing state...
metabase_card.global_median_household_assets: Refreshing state...
metabase_card.global_top_counties: Refreshing state...
metabase_card.global_household_sizes: Refreshing state...
metabase_card.global_median_annual_tax_credits: Refreshing state...
data.metabase_table.tenant_screen_summary_tables["tx"]: Read complete after 1s [name=mart_screener_data]
metabase_card.global_median_annual_income: Refreshing state...
metabase_card.global_household_languages: Refreshing state...
metabase_card.global_daily_screeners_7d: Refreshing state...
metabase_card.global_household_income_distribution: Refreshing state...
metabase_card.global_household_member_ages: Refreshing state...
metabase_card.global_top_counties_30d: Refreshing state...
metabase_card.global_qualified_for_benefits_pct: Refreshing state...
metabase_card.global_household_assets_distribution: Refreshing state...
metabase_card.global_head_of_household_ages: Refreshing state...
metabase_card.global_qualified_for_tax_creds_pct: Refreshing state...
metabase_card.global_median_annual_benefits: Refreshing state...
metabase_collection.tenant_collection_co: Refreshing state... [id=36]
metabase_card.screen_count: Refreshing state...
metabase_collection.tenant_collection_tx: Refreshing state... [id=37]
metabase_dashboard.analytics: Refreshing state... [name=MFB Analytics Dashboard]
metabase_collection.tenant_collection_il: Refreshing state... [id=38]
metabase_collection.tenant_collection_ma: Refreshing state... [id=39]
metabase_collection.tenant_collection_cesn: Refreshing state... [id=40]
metabase_collection.tenant_collection_co_tax_calculator: Refreshing state... [id=41]
metabase_card.tenant_screen_count["cesn"]: Refreshing state...
metabase_card.tenant_screen_count["nc"]: Refreshing state...
metabase_card.tenant_screen_count["ma"]: Refreshing state...
metabase_card.tenant_screen_count["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_screen_count["co"]: Refreshing state...
metabase_card.tenant_screen_count["il"]: Refreshing state...
metabase_card.tenant_screen_count["tx"]: Refreshing state...
metabase_card.tenant_partner_values["il"]: Refreshing state...
metabase_card.tenant_partner_values["ma"]: Refreshing state...
metabase_card.tenant_partner_values["nc"]: Refreshing state...
metabase_card.tenant_partner_values["tx"]: Refreshing state...
metabase_card.tenant_partner_values["cesn"]: Refreshing state...
metabase_card.tenant_partner_values["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_partner_values["co"]: Refreshing state...
metabase_card.tenant_monthly_active_users["ma"]: Refreshing state...
metabase_card.tenant_monthly_active_users["cesn"]: Refreshing state...
metabase_card.tenant_monthly_active_users["tx"]: Refreshing state...
metabase_card.tenant_monthly_active_users["il"]: Refreshing state...
metabase_card.tenant_monthly_active_users["co"]: Refreshing state...
metabase_card.tenant_monthly_active_users["nc"]: Refreshing state...
data.external.partner_field_ids: Read complete after 4s [id=-]
metabase_card.tenant_top_counties_30d["tx"]: Refreshing state...
metabase_card.tenant_top_counties_30d["nc"]: Refreshing state...
metabase_card.tenant_top_counties_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_top_counties_30d["ma"]: Refreshing state...
metabase_card.tenant_top_counties_30d["cesn"]: Refreshing state...
metabase_card.tenant_household_assets_distribution["cesn"]: Refreshing state...
metabase_card.tenant_top_counties_30d["co"]: Refreshing state...
metabase_card.tenant_top_counties_30d["il"]: Refreshing state...
metabase_card.tenant_median_household_assets["ma"]: Refreshing state...
metabase_card.tenant_household_assets_distribution["il"]: Refreshing state...
metabase_card.tenant_household_assets_distribution["co"]: Refreshing state...
metabase_card.tenant_household_assets_distribution["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_household_assets_distribution["ma"]: Refreshing state...
metabase_card.tenant_household_assets_distribution["nc"]: Refreshing state...
metabase_card.tenant_household_assets_distribution["tx"]: Refreshing state...
metabase_card.tenant_median_household_assets["nc"]: Refreshing state...
metabase_card.tenant_median_household_assets["tx"]: Refreshing state...
metabase_card.tenant_median_household_assets["co"]: Refreshing state...
metabase_card.tenant_median_household_assets["cesn"]: Refreshing state...
metabase_card.tenant_median_household_assets["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_household_assets["il"]: Refreshing state...
metabase_card.tenant_median_monthly_income["ma"]: Refreshing state...
metabase_card.tenant_median_monthly_income["cesn"]: Refreshing state...
metabase_card.tenant_median_monthly_income["co"]: Refreshing state...
metabase_card.tenant_median_monthly_income["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_monthly_income["il"]: Refreshing state...
metabase_card.tenant_median_monthly_income["nc"]: Refreshing state...
metabase_card.tenant_median_monthly_income["tx"]: Refreshing state...
metabase_card.tenant_already_had_benefits_pct["cesn"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits_30d["cesn"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits["ma"]: Refreshing state...
metabase_card.tenant_completed_screeners_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_monthly_expenses["tx"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits["il"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits_30d["co"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits_30d["il"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits_30d["ma"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits_30d["nc"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits_30d["tx"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits["tx"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits["cesn"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits["nc"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits["co"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_completed_screeners_30d["co"]: Refreshing state...
metabase_card.tenant_completed_screeners_30d["il"]: Refreshing state...
metabase_card.tenant_completed_screeners_30d["ma"]: Refreshing state...
metabase_card.tenant_completed_screeners_30d["nc"]: Refreshing state...
metabase_card.tenant_completed_screeners_30d["tx"]: Refreshing state...
metabase_card.tenant_completed_screeners_30d["cesn"]: Refreshing state...
metabase_card.tenant_median_monthly_expenses["co"]: Refreshing state...
metabase_card.tenant_median_monthly_expenses["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_monthly_expenses["cesn"]: Refreshing state...
metabase_card.tenant_median_monthly_expenses["il"]: Refreshing state...
metabase_card.tenant_median_monthly_expenses["ma"]: Refreshing state...
metabase_card.tenant_median_monthly_expenses["nc"]: Refreshing state...
metabase_card.tenant_top_counties["cesn"]: Refreshing state...
metabase_card.tenant_already_had_benefits_pct["co"]: Refreshing state...
metabase_card.tenant_already_had_benefits_pct["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_already_had_benefits_pct["il"]: Refreshing state...
metabase_card.tenant_already_had_benefits_pct["ma"]: Refreshing state...
metabase_card.tenant_already_had_benefits_pct["nc"]: Refreshing state...
metabase_card.tenant_already_had_benefits_pct["tx"]: Refreshing state...
metabase_card.tenant_top_counties["co"]: Refreshing state...
metabase_card.tenant_top_counties["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_top_counties["il"]: Refreshing state...
metabase_card.tenant_top_counties["nc"]: Refreshing state...
metabase_card.tenant_top_counties["ma"]: Refreshing state...
metabase_card.tenant_top_counties["tx"]: Refreshing state...
metabase_card.tenant_top_partners["cesn"]: Refreshing state...
metabase_card.tenant_top_partners["co"]: Refreshing state...
metabase_card.tenant_top_partners["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_top_partners["il"]: Refreshing state...
metabase_card.tenant_top_partners["ma"]: Refreshing state...
metabase_card.tenant_top_partners["nc"]: Refreshing state...
metabase_card.tenant_top_partners["tx"]: Refreshing state...
metabase_card.tenant_common_expenses["co"]: Refreshing state...
metabase_card.tenant_common_expenses["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_common_expenses["nc"]: Refreshing state...
metabase_card.tenant_common_expenses["tx"]: Refreshing state...
metabase_card.tenant_common_expenses["il"]: Refreshing state...
metabase_card.tenant_common_expenses["cesn"]: Refreshing state...
metabase_card.tenant_common_expenses["ma"]: Refreshing state...
metabase_card.tenant_household_member_ages["tx"]: Refreshing state...
metabase_card.tenant_household_member_ages["ma"]: Refreshing state...
metabase_card.tenant_household_member_ages["nc"]: Refreshing state...
metabase_card.tenant_household_member_ages["cesn"]: Refreshing state...
metabase_card.tenant_household_member_ages["il"]: Refreshing state...
metabase_card.tenant_household_member_ages["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_household_member_ages["co"]: Refreshing state...
metabase_card.tenant_immediate_needs_table["cesn"]: Refreshing state...
metabase_card.tenant_immediate_needs_table["co"]: Refreshing state...
metabase_card.tenant_immediate_needs_table["ma"]: Refreshing state...
metabase_card.tenant_immediate_needs_table["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_immediate_needs_table["nc"]: Refreshing state...
metabase_card.tenant_immediate_needs_table["il"]: Refreshing state...
metabase_card.tenant_immediate_needs_table["tx"]: Refreshing state...
metabase_card.tenant_completed_screeners["cesn"]: Refreshing state...
metabase_card.tenant_completed_screeners["tx"]: Refreshing state...
metabase_card.tenant_completed_screeners["co"]: Refreshing state...
metabase_card.tenant_completed_screeners["il"]: Refreshing state...
metabase_card.tenant_completed_screeners["ma"]: Refreshing state...
metabase_card.tenant_completed_screeners["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_completed_screeners["nc"]: Refreshing state...
metabase_card.tenant_household_languages["cesn"]: Refreshing state...
metabase_card.tenant_household_languages["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_household_languages["nc"]: Refreshing state...
metabase_card.tenant_household_languages["tx"]: Refreshing state...
metabase_card.tenant_household_languages["il"]: Refreshing state...
metabase_card.tenant_household_languages["co"]: Refreshing state...
metabase_card.tenant_household_languages["ma"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct["nc"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct["cesn"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct["co"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct["il"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct["tx"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct["ma"]: Refreshing state...
metabase_card.tenant_head_of_household_ages["tx"]: Refreshing state...
metabase_card.tenant_head_of_household_ages["cesn"]: Refreshing state...
metabase_card.tenant_head_of_household_ages["co"]: Refreshing state...
metabase_card.tenant_head_of_household_ages["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_head_of_household_ages["il"]: Refreshing state...
metabase_card.tenant_head_of_household_ages["nc"]: Refreshing state...
metabase_card.tenant_head_of_household_ages["ma"]: Refreshing state...
metabase_card.tenant_qualified_benefits_table["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_annual_income["il"]: Refreshing state...
metabase_card.tenant_median_annual_income["ma"]: Refreshing state...
metabase_card.tenant_median_annual_income["nc"]: Refreshing state...
metabase_card.tenant_qualified_benefits_table["il"]: Refreshing state...
metabase_card.tenant_median_annual_income["tx"]: Refreshing state...
metabase_card.tenant_qualified_benefits_table["ma"]: Refreshing state...
metabase_card.tenant_qualified_benefits_table["nc"]: Refreshing state...
metabase_card.tenant_median_annual_income["cesn"]: Refreshing state...
metabase_card.tenant_qualified_benefits_table["tx"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct_30d["cesn"]: Refreshing state...
metabase_card.tenant_median_annual_income["co"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct_30d["co"]: Refreshing state...
metabase_card.tenant_median_annual_income["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_qualified_benefits_table["co"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct_30d["ma"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct_30d["il"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct_30d["nc"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct_30d["tx"]: Refreshing state...
metabase_card.tenant_qualified_benefits_table["cesn"]: Refreshing state...
metabase_card.tenant_median_annual_benefits_30d["cesn"]: Refreshing state...
metabase_card.tenant_median_annual_benefits_30d["co"]: Refreshing state...
metabase_card.tenant_median_annual_benefits_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_annual_benefits_30d["nc"]: Refreshing state...
metabase_card.tenant_median_annual_benefits_30d["tx"]: Refreshing state...
metabase_card.tenant_median_annual_benefits_30d["il"]: Refreshing state...
metabase_card.tenant_median_annual_benefits_30d["ma"]: Refreshing state...
metabase_card.tenant_median_annual_benefits["tx"]: Refreshing state...
metabase_card.tenant_median_annual_benefits["ma"]: Refreshing state...
metabase_card.tenant_median_annual_benefits["nc"]: Refreshing state...
metabase_card.tenant_median_annual_benefits["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_annual_benefits["co"]: Refreshing state...
metabase_card.tenant_median_annual_benefits["cesn"]: Refreshing state...
metabase_card.tenant_median_annual_benefits["il"]: Refreshing state...
metabase_card.tenant_household_sizes["co"]: Refreshing state...
metabase_card.tenant_household_sizes["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_household_sizes["il"]: Refreshing state...
metabase_card.tenant_household_sizes["tx"]: Refreshing state...
metabase_card.tenant_household_sizes["ma"]: Refreshing state...
metabase_card.tenant_household_sizes["cesn"]: Refreshing state...
metabase_card.tenant_household_sizes["nc"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits_30d["nc"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits_30d["cesn"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits_30d["tx"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits_30d["il"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits_30d["ma"]: Refreshing state...
metabase_card.tenant_median_annual_tax_credits_30d["co"]: Refreshing state...
metabase_card.tenant_household_income_distribution["tx"]: Refreshing state...
metabase_card.tenant_household_income_distribution["co"]: Refreshing state...
metabase_card.tenant_household_income_distribution["il"]: Refreshing state...
metabase_card.tenant_household_income_distribution["cesn"]: Refreshing state...
metabase_card.tenant_household_income_distribution["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_household_income_distribution["ma"]: Refreshing state...
metabase_card.tenant_household_income_distribution["nc"]: Refreshing state...
metabase_card.tenant_top_partners_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_top_partners_30d["cesn"]: Refreshing state...
metabase_card.tenant_top_partners_30d["ma"]: Refreshing state...
metabase_card.tenant_top_partners_30d["il"]: Refreshing state...
metabase_card.tenant_top_partners_30d["co"]: Refreshing state...
metabase_card.tenant_top_partners_30d["nc"]: Refreshing state...
metabase_card.tenant_top_partners_30d["tx"]: Refreshing state...
metabase_card.tenant_income_streams["nc"]: Refreshing state...
metabase_card.tenant_income_streams["cesn"]: Refreshing state...
metabase_card.tenant_income_streams["tx"]: Refreshing state...
metabase_card.tenant_income_streams["il"]: Refreshing state...
metabase_card.tenant_income_streams["co"]: Refreshing state...
metabase_card.tenant_income_streams["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_income_streams["ma"]: Refreshing state...
metabase_card.tenant_median_household_size["co"]: Refreshing state...
metabase_card.tenant_median_household_size["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_household_size["ma"]: Refreshing state...
metabase_card.tenant_median_household_size["il"]: Refreshing state...
metabase_card.tenant_median_household_size["tx"]: Refreshing state...
metabase_card.tenant_median_household_size["nc"]: Refreshing state...
metabase_card.tenant_median_household_size["cesn"]: Refreshing state...
metabase_card.tenant_daily_screeners_7d["cesn"]: Refreshing state...
metabase_card.tenant_daily_screeners_7d["il"]: Refreshing state...
metabase_card.tenant_daily_screeners_7d["co"]: Refreshing state...
metabase_card.tenant_daily_screeners_7d["nc"]: Refreshing state...
metabase_card.tenant_daily_screeners_7d["ma"]: Refreshing state...
metabase_card.tenant_daily_screeners_7d["tx"]: Refreshing state...
metabase_card.tenant_daily_screeners_7d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_daily_screeners_30d["cesn"]: Refreshing state...
metabase_card.tenant_daily_screeners_30d["il"]: Refreshing state...
metabase_card.tenant_daily_screeners_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_daily_screeners_30d["co"]: Refreshing state...
metabase_card.tenant_daily_screeners_30d["tx"]: Refreshing state...
metabase_card.tenant_daily_screeners_30d["nc"]: Refreshing state...
metabase_card.tenant_daily_screeners_30d["ma"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct_30d["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct_30d["cesn"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct_30d["co"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct_30d["ma"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct_30d["il"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct_30d["nc"]: Refreshing state...
metabase_card.tenant_qualified_for_benefits_pct_30d["tx"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct["cesn"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct["co"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct["ma"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct["il"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct["nc"]: Refreshing state...
metabase_card.tenant_qualified_for_tax_creds_pct["tx"]: Refreshing state...
metabase_card.tenant_current_benefits_table["ma"]: Refreshing state...
metabase_card.tenant_current_benefits_table["cesn"]: Refreshing state...
metabase_card.tenant_current_benefits_table["il"]: Refreshing state...
metabase_card.tenant_current_benefits_table["nc"]: Refreshing state...
metabase_card.tenant_current_benefits_table["tx"]: Refreshing state...
metabase_card.tenant_current_benefits_table["co"]: Refreshing state...
metabase_card.tenant_current_benefits_table["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits["tx"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits["ma"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits["cesn"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits["co"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits["nc"]: Refreshing state...
metabase_card.tenant_median_monthly_benefits["il"]: Refreshing state...
metabase_dashboard.tenant_analytics["co_tax_calculator"]: Refreshing state... [name=CO Tax Calculator Dashboard]
metabase_dashboard.tenant_analytics["co"]: Refreshing state... [name=Colorado Dashboard]
metabase_dashboard.tenant_analytics["il"]: Refreshing state... [name=Illinois Dashboard]
metabase_dashboard.tenant_analytics["tx"]: Refreshing state... [name=Texas Dashboard]
metabase_dashboard.tenant_analytics["cesn"]: Refreshing state... [name=CESN Dashboard]
metabase_dashboard.tenant_analytics["ma"]: Refreshing state... [name=Massachusetts Dashboard]
metabase_dashboard.tenant_analytics["nc"]: Refreshing state... [name=North Carolina Dashboard]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # metabase_collection_graph.graph will be created
  + resource "metabase_collection_graph" "graph" {
      + ignored_groups = [
          + 2,
        ]
      + permissions    = [
          + {
              + collection = "34"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "35"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "35"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "36"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "36"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "37"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "37"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "38"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "38"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "39"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "39"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "40"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "40"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "41"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "41"
              + group      = (known after apply)
              + permission = "write"
            },
        ]
      + revision       = (known after apply)
    }

  # metabase_permissions_graph.graph will be created
  + resource "metabase_permissions_graph" "graph" {
      + advanced_permissions = false
      + ignored_groups       = [
          + 2,
        ]
      + permissions          = [
          + {
              + create_queries = "no"
              + database       = 1
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 1
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 34
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 35
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 37
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 38
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 39
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 40
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 41
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = 1
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "no"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 34
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 35
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 36
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 37
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 38
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 39
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 40
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 41
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
          + {
              + create_queries = "query-builder-and-native"
              + database       = 67
              + group          = (known after apply)
              + view_data      = "unrestricted"
            },
        ]
      + revision             = (known after apply)
    }

  # metabase_permissions_group.global will be created
  + resource "metabase_permissions_group" "global" {
      + id   = (known after apply)
      + name = "Global"
    }

  # metabase_permissions_group.tenant["cesn"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "CESN"
    }

  # metabase_permissions_group.tenant["co"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Colorado"
    }

  # metabase_permissions_group.tenant["co_tax_calculator"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "CO Tax Calculator"
    }

  # metabase_permissions_group.tenant["il"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Illinois"
    }

  # metabase_permissions_group.tenant["ma"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Massachusetts"
    }

  # metabase_permissions_group.tenant["nc"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "North Carolina"
    }

  # metabase_permissions_group.tenant["tx"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Texas"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + global_group_id       = (known after apply)
  + tenant_group_ids      = {
      + cesn              = (known after apply)
      + co                = (known after apply)
      + co_tax_calculator = (known after apply)
      + il                = (known after apply)
      + ma                = (known after apply)
      + nc                = (known after apply)
      + tx                = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @IrynaKolh, Action: `pull_request`, Environment: `staging`*